In [51]:
import pandas as pd

In [52]:
df = pd.read_csv('C:/Users/Ashwin/Documents/topmentor/Batch-59-Datasets-main/book_data.csv')

In [53]:
df.head()

,Author_ID,Book_ISSN,Place_of_Publication,Year_of_Publication,Category,TotalSales
0,13265,821631078-1,Tokyo,1964,Fantasy,14562.23
1,46875,506970332-3,NY,2007,Fantasy,57767.94
2,33339,682297776-7,london,1973,Horror,11704.38
3,46875,460648890-5,london,1975,Fantasy,43632.71
4,5487,326396560-3,NY,1976,Horror,54414.40

In [54]:
df.isna().sum()

Author_ID                0
Book_ISSN                0
Place_of_Publication     0
Year_of_Publication      0
Category                41
TotalSales              30
dtype: int64

In [39]:
df.shape

(1000, 6)

Data Exploration

In [45]:
df.describe(include='all')

,Author_ID,Book_ISSN,Place_of_Publication,Year_of_Publication,Category,TotalSales
count,1000.000000,1000,1000,1000.00000,959,9.700000e+02
unique,NaN,1000,7,NaN,5,NaN
top,NaN,077128260-5,New York,NaN,Horror,NaN
freq,NaN,1,154,NaN,207,NaN
mean,14423.444000,NaN,NaN,1984.01300,NaN,4.340683e+04
std,19069.330766,NaN,NaN,20.27792,NaN,2.557979e+05
min,565.000000,NaN,NaN,1950.00000,NaN,5.099330e+03
25%,1235.000000,NaN,NaN,1966.75000,NaN,1.936011e+04
50%,5487.000000,NaN,NaN,1983.00000,NaN,3.396824e+04
75%,23628.000000,NaN,NaN,2002.00000,NaN,4.645848e+04
max,65569.000000,NaN,NaN,2021.00000,NaN,7.825635e+06

In [50]:
df['TotalSales'].quantile(0.75)

46458.4775